export default {
  // 特殊字符包含中文
  special: '[`~!@#$^&*()=|{}\':;\',\\[\\].<>/?~！@#￥……&*（）——|{}【】‘；：”“\'。，、？%+_]',

  // 中文字符
  chinese: '[\u4e00-\u9fa5]',

  // 正整数
  positiveInteger: '^[0-9]*$',

  // 身份证号(15位、18位数字)，最后一位是校验位，可能为数字或字符X
  identity: '(^\\d{15}$)|(^\\d{18}$)|(^\\d{17}(\\d|X|x)$)',

  // 手机号码
  cellphone: '^(13[0-9]|14[5|7]|15[0|1|2|3|4|5|6|7|8|9]|18[0|1|2|3|5|6|7|8|9])\\d{8}$',

  // 座机号码 电话号码("XXX-XXXXXXX"、"XXXX-XXXXXXXX"、"XXX-XXXXXXX"、"XXX-XXXXXXXX"、"XXXXXXX"和"XXXXXXXX)
  telephone: '^(\\(\\d{3,4}-)|\\d{3.4}-)?\\d{7,8}$',

  // 强密码(必须包含大小写字母和数字的组合，不能使用特殊字符，长度在 8-10 之间)
  strongPassword: '^(?=.*\\d)(?=.*[a-z])(?=.*[A-Z])[a-zA-Z0-9]{8,10}$',

  // 强密码(必须包含大小写字母和数字的组合，可以使用特殊字符，长度在8-10之间)
  strongAllPassword: '^(?=.*\\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$'

}
